# Taps
# Only keep the non-standard tap
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'tmux'
brew 'trash'
brew 'tree'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'composer'
brew 'node'
brew 'bun'

# Apps
cask '1password'
cask 'cleanshot'
cask 'cursor'
cask 'discord'
cask 'figma'
cask 'ghostty'
cask 'github'
cask 'helium-browser'
cask 'herd'
cask 'imageoptim'
cask 'inna'
cask 'keka'
cask 'localsend'
cask 'mullvadvpn'
cask 'notion'
cask 'opencode'
cask 'raycast'
cask 'rectangle'
cask 'spotify'
cask 'tableplus'
cask 'tailscale'
cask 'telegram'
cask 'ticktick'
cask 'visual-studio-code'

# Fonts
cask 'font-geist'
cask 'font-geist-mono'
cask 'font-inter'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'

# Mac App Store
mas 'Hidden Bar', id: 1452453066
mas 'Unsplash Wallpapers', id: 1284863847
